---
kind: property
id: P:Autodesk.Revit.DB.FormArray.Size
source: html/47113753-e65d-eb94-221d-acb819c6d77e.htm
---
# Autodesk.Revit.DB.FormArray.Size Property

Returns the number of forms that are in the array.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```